mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/Core/Src/driver_BNO080.c
/**
 ******************************************************************************
 * File Name           : driver_BNO080.hpp
  * Description        : Header for Lights.
  ******************************************************************************

  *
  ******************************************************************************
 */


/* includes -----------------------------------------------------------*/
#include <driver_BNO080.h>
#include "math.h"
#include "stm32wbxx_hal.h"
#include "i2c.h"
#include "stdint.h"
#include <string.h>
#include "inertial_sensing.h"
#include "inter_processor_comms.h"
#include "master_thread.h"

/* typedef -----------------------------------------------------------*/


/* defines -----------------------------------------------------------*/
#define PACKET_LSB		0
#define PACKET_MSB		1
#define CHANNEL_NUM		2
#define SEQUENCE_NUM	3

/* macros ------------------------------------------------------------*/


/* function prototypes -----------------------------------------------*/


/* variables -----------------------------------------------*/
struct stepData	stepSample;
struct stabilityData stabilitySample;
struct activityData activitySample;
struct rotationData rotSample;



//Registers
const uint8_t CHANNEL_COMMAND = 0;
const uint8_t CHANNEL_EXECUTABLE = 1;
const uint8_t CHANNEL_CONTROL = 2;
const uint8_t CHANNEL_REPORTS = 3;
const uint8_t CHANNEL_WAKE_REPORTS = 4;
const uint8_t CHANNEL_GYRO = 5;

//Global Variables
uint8_t shtpHeader[4]; //Each packet has a header of 4 bytes
uint8_t shtpData[MAX_PACKET_SIZE];
uint8_t sequenceNumber[6] = {0, 0, 0, 0, 0, 0}; //There are 6 com channels. Each channel has its own seqnum
uint8_t commandSequenceNumber = 0;				//Commands have a seqNum as well. These are inside command packet, the header uses its own seqNum per channel
uint32_t metaData[MAX_METADATA_SIZE];			//There is more than 10 words in a metadata record but we'll stop at Q point 3

uint8_t receiveBuffer[I2C_BUFFER_LENGTH] = {0};

//These Q values are defined in the datasheet but can also be obtained by querying the meta data records
//See the read metadata example for more info
int16_t rotationVector_Q1 = 14;
int16_t accelerometer_Q1 = 8;
int16_t linear_accelerometer_Q1 = 8;
int16_t gyro_Q1 = 9;
int16_t magnetometer_Q1 = 4;

uint8_t outPacket[32];

//private:
//Variables
//	TwoWire *_i2cPort;		//The generic connection to user's chosen I2C hardware
uint8_t _deviceAddress; //Keeps track of I2C address. setI2CAddress changes this.

//	Stream *_debugPort;			 //The stream to send debug messages to if enabled. Usually Serial.
//bool _printDebug = False; //Flag to print debugging variables

//	SPIClass *_spiPort;			 //The generic connection to user's chosen SPI hardware
unsigned long _spiPortSpeed; //Optional user defined port speed
uint8_t _cs;				 //Pins needed for SPI
uint8_t _wake;
uint8_t _int;
GPIO_TypeDef* _intPort;
uint8_t _rst;

//These are the raw sensor values (without Q applied) pulled from the user requested Input Report
uint16_t rawAccelX, rawAccelY, rawAccelZ, accelAccuracy;
uint16_t rawLinAccelX, rawLinAccelY, rawLinAccelZ, accelLinAccuracy;
uint16_t rawGyroX, rawGyroY, rawGyroZ, gyroAccuracy;
uint16_t rawMagX, rawMagY, rawMagZ, magAccuracy;
uint16_t rawQuatI, rawQuatJ, rawQuatK, rawQuatReal, rawQuatRadianAccuracy, quatAccuracy;
uint16_t stepCount;
uint32_t timeStamp;
uint8_t stabilityClassifier;
uint8_t activityClassifier;
uint8_t *_activityConfidences;						  //Array that store the confidences of the 9 possible activities
uint8_t calibrationStatus;							  //Byte R0 of ME Calibration Response
uint16_t memsRawAccelX, memsRawAccelY, memsRawAccelZ; //Raw readings from MEMS sensor
uint16_t memsRawGyroX, memsRawGyroY, memsRawGyroZ;	//Raw readings from MEMS sensor
uint16_t memsRawMagX, memsRawMagY, memsRawMagZ;		  //Raw readings from MEMS sensor

/* Functions Definition ------------------------------------------------------*/
//Attempt communication with the device
//Return true if we got a 'Polo' back from Marco
bool IMU_begin(uint8_t deviceAddress, uint8_t intPin, GPIO_TypeDef* intPort)
{
	_deviceAddress = deviceAddress << 1; //If provided, store the I2C address from user
//	_i2cPort = &wirePort;			//Grab which port the user wants us to use
	_int = intPin;					//Get the pin that the user wants to use for interrupts. By default, it's NULL and we'll not use it in dataAvailable() function.
	_intPort = intPort;

	//We expect caller to begin their I2C port, with the speed of their choice external to the library
	//But if they forget, we start the hardware here.
	//_i2cPort->begin();

	//Begin by resetting the IMU
	IMU_softReset();

	//Check communication with device
	shtpData[0] = SHTP_REPORT_PRODUCT_ID_REQUEST; //Request the product ID and reset info
	shtpData[1] = 0;							  //Reserved

	//Transmit packet on channel 2, 2 bytes
	IMU_sendPacket(CHANNEL_CONTROL, 2);

	//Now we wait for response
	if (IMU_receivePacket() == true)
	{
		if (shtpData[0] == SHTP_REPORT_PRODUCT_ID_RESPONSE)
		{
			return (true);
		}
	}

	return (false); //Something went wrong
}

//bool IMU_beginSPI(uint8_t user_CSPin, uint8_t user_WAKPin, uint8_t user_INTPin, uint8_t user_RSTPin, uint32_t spiPortSpeed)
//{
////	_i2cPort = NULL; //This null tells the send/receive functions to use SPI
////
////	//Get user settings
////	_spiPort = &spiPort;
////	_spiPortSpeed = spiPortSpeed;
////	if (_spiPortSpeed > 3000000)
////		_spiPortSpeed = 3000000; //BNO080 max is 3MHz
////
////	_cs = user_CSPin;
////	_wake = user_WAKPin;
////	_int = user_INTPin;
////	_rst = user_RSTPin;
////
////	pinMode(_cs, OUTPUT);
////	pinMode(_wake, OUTPUT);
////	pinMode(_int, INPUT_PULLUP);
////	pinMode(_rst, OUTPUT);
////
////	digitalWrite(_cs, HIGH); //Deselect BNO080
////
////	//Configure the BNO080 for SPI communication
////	digitalWrite(_wake, HIGH); //Before boot up the PS0/WAK pin must be high to enter SPI mode
////	digitalWrite(_rst, LOW);   //Reset BNO080
////	delay(2);				   //Min length not specified in datasheet?
////	digitalWrite(_rst, HIGH);  //Bring out of reset
////
////	//Wait for first assertion of INT before using WAK pin. Can take ~104ms
////	waitForSPI();
////
////	//if(wakeBNO080() == false) //Bring IC out of sleep after reset
////	//  Serial.println("BNO080 did not wake up");
////
////	_spiPort->begin(); //Turn on SPI hardware
////
////	//At system startup, the hub must send its full advertisement message (see 5.2 and 5.3) to the
////	//host. It must not send any other data until this step is complete.
////	//When BNO080 first boots it broadcasts big startup packet
////	//Read it and dump it
////	waitForSPI(); //Wait for assertion of INT before reading advert message.
////	receivePacket();
////
////	//The BNO080 will then transmit an unsolicited Initialize Response (see 6.4.5.2)
////	//Read it and dump it
////	waitForSPI(); //Wait for assertion of INT before reading Init response
////	receivePacket();
////
////	//Check communication with device
////	shtpData[0] = SHTP_REPORT_PRODUCT_ID_REQUEST; //Request the product ID and reset info
////	shtpData[1] = 0;							  //Reserved
////
////	//Transmit packet on channel 2, 2 bytes
////	sendPacket(CHANNEL_CONTROL, 2);
////
////	//Now we wait for response
////	waitForSPI();
////	if (receivePacket() == true)
////	{
////		if (shtpData[0] == SHTP_REPORT_PRODUCT_ID_RESPONSE)
////			return (true);
////	}
//
//	return (false); //Something went wrong
//}

//Calling this function with nothing sets the debug port to Serial
//You can also call it with other streams like Serial1, SerialUSB, etc.
//void IMU_enableDebugging(Stream &debugPort)
//{
////	_debugPort = &debugPort;
////	_printDebug = true;
//}

//Updates the latest variables if possible
//Returns false if new readings are not available
bool IMU_dataAvailable(void)
{
	//If we have an interrupt pin connection available, check if data is available.
	//If int pin is not set, then we'll rely on receivePacket() to timeout
	//See issue 13: https://github.com/sparkfun/SparkFun_BNO080_Arduino_Library/issues/13
	if (_int != 255)
	{
		if( HAL_GPIO_ReadPin(_intPort, _int) == GPIO_PIN_SET)
			return (false);
//		if (digitalRead(_int) == HIGH)
//			return (false);
	}

//	if(HAL_GPIO_ReadPin(_intPort, _int) == GPIO_PIN_SET)
//	{
	if (IMU_receivePacket() == true)
	{
		//Check to see if this packet is a sensor reporting its data to us
		if (shtpHeader[2] == CHANNEL_REPORTS && shtpData[0] == SHTP_REPORT_BASE_TIMESTAMP)
		{
			IMU_parseInputReport(); //This will update the rawAccelX, etc variables depending on which feature report is found
			return (true);
		}
		else if (shtpHeader[2] == CHANNEL_CONTROL)
		{
			IMU_parseCommandReport(); //This will update responses to commands, calibrationStatus, etc.
			return (true);
		}
	}
//	}
	return (false);
}

//This function pulls the data from the command response report

//Unit responds with packet that contains the following:
//shtpHeader[0:3]: First, a 4 byte header
//shtpData[0]: The Report ID
//shtpData[1]: Sequence number (See 6.5.18.2)
//shtpData[2]: Command
//shtpData[3]: Command Sequence Number
//shtpData[4]: Response Sequence Number
//shtpData[5 + 0]: R0
//shtpData[5 + 1]: R1
//shtpData[5 + 2]: R2
//shtpData[5 + 3]: R3
//shtpData[5 + 4]: R4
//shtpData[5 + 5]: R5
//shtpData[5 + 6]: R6
//shtpData[5 + 7]: R7
//shtpData[5 + 8]: R8
void IMU_parseCommandReport(void)
{
	if (shtpData[0] == SHTP_REPORT_COMMAND_RESPONSE)
	{
		//The BNO080 responds with this report to command requests. It's up to use to remember which command we issued.
		uint8_t command = shtpData[2]; //This is the Command byte of the response

		if (command == COMMAND_ME_CALIBRATE)
		{
			calibrationStatus = shtpData[5 + 0]; //R0 - Status (0 = success, non-zero = fail)
		}
	}
	else
	{
		//This sensor report ID is unhandled.
		//See reference manual to add additional feature reports as needed
	}

	//TODO additional feature reports may be strung together. Parse them all.
}

//This function pulls the data from the input report
//The input reports vary in length so this function stores the various 16-bit values as globals

//Unit responds with packet that contains the following:
//shtpHeader[0:3]: First, a 4 byte header
//shtpData[0:4]: Then a 5 byte timestamp of microsecond clicks since reading was taken
//shtpData[5 + 0]: Then a feature report ID (0x01 for Accel, 0x05 for Rotation Vector)
//shtpData[5 + 1]: Sequence number (See 6.5.18.2)
//shtpData[5 + 2]: Status
//shtpData[3]: Delay
//shtpData[4:5]: i/accel x/gyro x/etc
//shtpData[6:7]: j/accel y/gyro y/etc
//shtpData[8:9]: k/accel z/gyro z/etc
//shtpData[10:11]: real/gyro temp/etc
//shtpData[12:13]: Accuracy estimate
void IMU_parseInputReport(void)
{
	//Calculate the number of data bytes in this packet
	int16_t dataLength = ((uint16_t)shtpHeader[1] << 8 | shtpHeader[0]);
	dataLength &= ~(1 << 15); //Clear the MSbit. This bit indicates if this package is a continuation of the last.
	//Ignore it for now. TODO catch this as an error and exit

	dataLength -= 4; //Remove the header bytes from the data count

	timeStamp = ((uint32_t)shtpData[4] << (8 * 3)) | ((uint32_t)shtpData[3] << (8 * 2)) | ((uint32_t)shtpData[2] << (8 * 1)) | ((uint32_t)shtpData[1] << (8 * 0));

	uint8_t status = shtpData[5 + 2] & 0x03; //Get status bits
	uint16_t data1 = (uint16_t)shtpData[5 + 5] << 8 | shtpData[5 + 4];
	uint16_t data2 = (uint16_t)shtpData[5 + 7] << 8 | shtpData[5 + 6];
	uint16_t data3 = (uint16_t)shtpData[5 + 9] << 8 | shtpData[5 + 8];
	uint16_t data4 = 0;
	uint16_t data5 = 0; //We would need to change this to uin32_t to capture time stamp value on Raw Accel/Gyro/Mag reports

	if (dataLength - 5 > 9)
	{
		data4 = (uint16_t)shtpData[5 + 11] << 8 | shtpData[5 + 10];
	}
	if (dataLength - 5 > 11)
	{
		data5 = (uint16_t)shtpData[5 + 13] << 8 | shtpData[5 + 12];
	}

	//Store these generic values to their proper global variable
	if (shtpData[5] == SENSOR_REPORTID_ACCELEROMETER)
	{
		accelAccuracy = status;
		rawAccelX = data1;
		rawAccelY = data2;
		rawAccelZ = data3;
	}
	else if (shtpData[5] == SENSOR_REPORTID_LINEAR_ACCELERATION)
	{
		accelLinAccuracy = status;
		rawLinAccelX = data1;
		rawLinAccelY = data2;
		rawLinAccelZ = data3;
	}
	else if (shtpData[5] == SENSOR_REPORTID_GYROSCOPE)
	{
		gyroAccuracy = status;
		rawGyroX = data1;
		rawGyroY = data2;
		rawGyroZ = data3;
	}
	else if (shtpData[5] == SENSOR_REPORTID_MAGNETIC_FIELD)
	{
		magAccuracy = status;
		rawMagX = data1;
		rawMagY = data2;
		rawMagZ = data3;
	}
	else if (shtpData[5] == SENSOR_REPORTID_ROTATION_VECTOR || shtpData[5] == SENSOR_REPORTID_GAME_ROTATION_VECTOR)
	{
		// put rotation sample in queue for message packing
		rotSample.tick_ms = HAL_GetTick();
		rotSample.quatI =  IMU_qToFloat(data1, rotationVector_Q1);;
		rotSample.quatJ =  IMU_qToFloat(data1, rotationVector_Q1);;
		rotSample.quatK =  IMU_qToFloat(data1, rotationVector_Q1);;
		rotSample.quatReal = IMU_qToFloat(data1, rotationVector_Q1);
		rotSample.quatRadianAccuracy = IMU_qToFloat(data1, 12);

		osMessageQueuePut(rotationSampleQueueHandle, &rotSample, 0U, osWaitForever);

