mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/Core/Src/driver_BNO080.c
		quatAccuracy = status;
		rawQuatI = data1;
		rawQuatJ = data2;
		rawQuatK = data3;
		rawQuatReal = data4;
		rawQuatRadianAccuracy = data5; //Only available on rotation vector, not game rot vector
	}
	else if (shtpData[5] == SENSOR_REPORTID_STEP_COUNTER)
	{
		// put step cnt sample in queue for message packing
		stepSample.tick_ms = HAL_GetTick();
		stepSample.stepCount = data3;

//		osMessageQueuePut(stepSampleQueueHandle, &stepSample, 0U, osWaitForever);

		stepCount = data3; //Bytes 8/9
	}
	else if (shtpData[5] == SENSOR_REPORTID_STABILITY_CLASSIFIER)
	{

		// put stability sample in queue for message packing
		stabilitySample.tick_ms = HAL_GetTick();
		stabilitySample.stabilityClass = shtpData[5 + 4];

//		osMessageQueuePut(stabilitySampleQueueHandle, &stabilitySample, 0U, osWaitForever);

		stabilityClassifier = shtpData[5 + 4]; //Byte 4 only
	}
	else if (shtpData[5] == SENSOR_REPORTID_PERSONAL_ACTIVITY_CLASSIFIER)
	{
		activitySample.tick_ms = HAL_GetTick();

		//Load activity classification confidences into the array
		for (uint8_t x = 0; x < 9; x++)					   //Hardcoded to max of 9. TODO - bring in array size
			_activityConfidences[x] = shtpData[5 + 6 + x]; //5 bytes of timestamp, byte 6 is first confidence byte

		activityClassifier = shtpData[5 + 5]; //Most likely state

		// put activity sample in queue for message packing
		memcpy(activitySample.activityConfidence, _activityConfidences, 9);

		osMessageQueuePut(activitySampleQueueHandle, &activitySample, 0U, osWaitForever);



	}
	else if (shtpData[5] == SENSOR_REPORTID_RAW_ACCELEROMETER)
	{
		memsRawAccelX = data1;
		memsRawAccelY = data2;
		memsRawAccelZ = data3;
	}
	else if (shtpData[5] == SENSOR_REPORTID_RAW_GYROSCOPE)
	{
		memsRawGyroX = data1;
		memsRawGyroY = data2;
		memsRawGyroZ = data3;
	}
	else if (shtpData[5] == SENSOR_REPORTID_RAW_MAGNETOMETER)
	{
		memsRawMagX = data1;
		memsRawMagY = data2;
		memsRawMagZ = data3;
	}
	else if (shtpData[5] == SHTP_REPORT_COMMAND_RESPONSE)
	{
//		Serial.println("!");
		//The BNO080 responds with this report to command requests. It's up to use to remember which command we issued.
		uint8_t command = shtpData[5 + 2]; //This is the Command byte of the response

		if (command == COMMAND_ME_CALIBRATE)
		{
			//Serial.println("ME Cal report found!");
			calibrationStatus = shtpData[5 + 5]; //R0 - Status (0 = success, non-zero = fail)
		}
	}
	else
	{
		//This sensor report ID is unhandled.
		//See reference manual to add additional feature reports as needed
	}

	//TODO additional feature reports may be strung together. Parse them all.
}

//Return the rotation vector quaternion I
float IMU_getQuatI()
{
	float quat = IMU_qToFloat(rawQuatI, rotationVector_Q1);
	return (quat);
}

//Return the rotation vector quaternion J
float IMU_getQuatJ()
{
	float quat = IMU_qToFloat(rawQuatJ, rotationVector_Q1);
	return (quat);
}

//Return the rotation vector quaternion K
float IMU_getQuatK()
{
	float quat = IMU_qToFloat(rawQuatK, rotationVector_Q1);
	return (quat);
}

//Return the rotation vector quaternion Real
float IMU_getQuatReal()
{
	float quat = IMU_qToFloat(rawQuatReal, rotationVector_Q1);
	return (quat);
}

//Return the rotation vector accuracy
float IMU_getQuatRadianAccuracy()
{
	float quat = IMU_qToFloat(rawQuatRadianAccuracy, rotationVector_Q1);
	return (quat);
}

//Return the acceleration component
uint8_t IMU_getQuatAccuracy()
{
	return (quatAccuracy);
}

//Return the acceleration component
float IMU_getAccelX()
{
	float accel = IMU_qToFloat(rawAccelX, accelerometer_Q1);
	return (accel);
}

//Return the acceleration component
float IMU_getAccelY()
{
	float accel = IMU_qToFloat(rawAccelY, accelerometer_Q1);
	return (accel);
}

//Return the acceleration component
float IMU_getAccelZ()
{
	float accel = IMU_qToFloat(rawAccelZ, accelerometer_Q1);
	return (accel);
}

//Return the acceleration component
uint8_t IMU_getAccelAccuracy()
{
	return (accelAccuracy);
}

// linear acceleration, i.e. minus gravity

//Return the acceleration component
float IMU_getLinAccelX()
{
	float accel = IMU_qToFloat(rawLinAccelX, linear_accelerometer_Q1);
	return (accel);
}

//Return the acceleration component
float IMU_getLinAccelY()
{
	float accel = IMU_qToFloat(rawLinAccelY, linear_accelerometer_Q1);
	return (accel);
}

//Return the acceleration component
float IMU_getLinAccelZ()
{
	float accel = IMU_qToFloat(rawLinAccelZ, linear_accelerometer_Q1);
	return (accel);
}

//Return the acceleration component
uint8_t IMU_getLinAccelAccuracy()
{
	return (accelLinAccuracy);
}

//Return the gyro component
float IMU_getGyroX()
{
	float gyro = IMU_qToFloat(rawGyroX, gyro_Q1);
	return (gyro);
}

//Return the gyro component
float IMU_getGyroY()
{
	float gyro = IMU_qToFloat(rawGyroY, gyro_Q1);
	return (gyro);
}

//Return the gyro component
float IMU_getGyroZ()
{
	float gyro = IMU_qToFloat(rawGyroZ, gyro_Q1);
	return (gyro);
}

//Return the gyro component
uint8_t IMU_getGyroAccuracy()
{
	return (gyroAccuracy);
}

//Return the magnetometer component
float IMU_getMagX()
{
	float mag = IMU_qToFloat(rawMagX, magnetometer_Q1);
	return (mag);
}

//Return the magnetometer component
float IMU_getMagY()
{
	float mag = IMU_qToFloat(rawMagY, magnetometer_Q1);
	return (mag);
}

//Return the magnetometer component
float IMU_getMagZ()
{
	float mag = IMU_qToFloat(rawMagZ, magnetometer_Q1);
	return (mag);
}

//Return the mag component
uint8_t IMU_getMagAccuracy()
{
	return (magAccuracy);
}

//Return the step count
uint16_t IMU_getStepCount()
{
	return (stepCount);
}

//Return the stability classifier
uint8_t IMU_getStabilityClassifier()
{
	return (stabilityClassifier);
}

//Return the activity classifier
uint8_t IMU_getActivityClassifier()
{
	return (activityClassifier);
}

//Return the time stamp
uint32_t IMU_getTimeStamp()
{
	return (timeStamp);
}

//Return raw mems value for the accel
int16_t IMU_getRawAccelX()
{
	return (memsRawAccelX);
}
//Return raw mems value for the accel
int16_t IMU_getRawAccelY()
{
	return (memsRawAccelY);
}
//Return raw mems value for the accel
int16_t IMU_getRawAccelZ()
{
	return (memsRawAccelZ);
}

//Return raw mems value for the gyro
int16_t IMU_getRawGyroX()
{
	return (memsRawGyroX);
}
int16_t IMU_getRawGyroY()
{
	return (memsRawGyroY);
}
int16_t IMU_getRawGyroZ()
{
	return (memsRawGyroZ);
}

//Return raw mems value for the mag
int16_t IMU_getRawMagX()
{
	return (memsRawMagX);
}
int16_t IMU_getRawMagY()
{
	return (memsRawMagY);
}
int16_t IMU_getRawMagZ()
{
	return (memsRawMagZ);
}

