mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/Core/Src/driver_BNO080.c
////Blocking wait for BNO080 to assert (pull low) the INT pin
////indicating it's ready for comm. Can take more than 104ms
////after a hardware reset
//bool IMU_waitForSPI()
//{
////	for (uint8_t counter = 0; counter < 125; counter++) //Don't got more than 255
////	{
////		if (digitalRead(_int) == LOW)
////			return (true);
////		if (_printDebug == true)
////			_debugPort->println(F("SPI Wait"));
////		delay(1);
////	}
////
////	if (_printDebug == true)
////		_debugPort->println(F("SPI INT timeout"));
//	return (false);
//}

//Check to see if there is any new data available
//Read the contents of the incoming packet into the shtpData array
bool IMU_receivePacket(void)
{
	if( HAL_GPIO_ReadPin(_intPort, _int) == GPIO_PIN_SET)
		return (false);

	//Ask for four bytes to find out how much data we need to read
	osSemaphoreAcquire(messageI2C_LockSem, osWaitForever);
	while( HAL_I2C_Master_Receive(&hi2c1, _deviceAddress, shtpHeader, (uint8_t) 4, 100) != HAL_OK){
		osSemaphoreRelease(messageI2C_LockSem);
		HAL_Delay(100);
		osSemaphoreAcquire(messageI2C_LockSem, osWaitForever);
	}
	osSemaphoreRelease(messageI2C_LockSem);

	//Calculate the number of data bytes in this packet
	int16_t dataLength = ( ((uint16_t)shtpHeader[PACKET_MSB] << 8) | shtpHeader[PACKET_LSB]);
	dataLength &= ~(1 << 15); //Clear the MSbit.
	//This bit indicates if this package is a continuation of the last. Ignore it for now.
	//TODO catch this as an error and exit
	if (dataLength == 0)
	{
		//Packet is empty
		return (false); //All done
	}
	dataLength -= 4; //Remove the header bytes from the data count

	IMU_getData(dataLength);


	return (true); //We're done!
}

//Sends multiple requests to sensor until all data bytes are received from sensor
//The shtpData buffer has max capacity of MAX_PACKET_SIZE. Any bytes over this amount will be lost.
//Arduino I2C read limit is 32 bytes. Header is 4 bytes, so max data we can read per interation is 28 bytes
bool IMU_getData(uint16_t bytesRemaining)
{
	uint16_t dataSpot = 0; //Start at the beginning of shtpData array

//	uint8_t receiveBuffer[28] = {0};
//	uint8_t receivePacket[I2C_BUFFER_LENGTH - 4] = {0};


	//Setup a series of chunked 32 byte reads
	while (bytesRemaining > 0)
	{
		uint16_t numberOfBytesToRead = bytesRemaining;
		if (numberOfBytesToRead > (I2C_BUFFER_LENGTH - 4))
			numberOfBytesToRead = (I2C_BUFFER_LENGTH - 4);

		osSemaphoreAcquire(messageI2C_LockSem, osWaitForever);
		while( HAL_I2C_Master_Receive(&hi2c1, _deviceAddress, receiveBuffer, (uint8_t)(numberOfBytesToRead + 4), 100) != HAL_OK){
			osSemaphoreRelease(messageI2C_LockSem);
			HAL_Delay(100);
			osSemaphoreAcquire(messageI2C_LockSem, osWaitForever);
		}
		osSemaphoreRelease(messageI2C_LockSem);


//		_i2cPort->requestFrom((uint8_t)_deviceAddress, (uint8_t)(numberOfBytesToRead + 4));
//		if (waitForI2C() == false)
//			return (0); //Error

		// first four bytes are header bytes and can be thrown away
		if ( (dataSpot + numberOfBytesToRead) < MAX_PACKET_SIZE){
			memcpy(&(shtpData[dataSpot]), &(receiveBuffer[4]), numberOfBytesToRead);
		}
		else
		{
			// Do nothing with the data
		}

		// increment data index
		// TODO: this can be changed to receive a larger buffer since this constraint is for the Arduino
		dataSpot += numberOfBytesToRead;

		bytesRemaining -= numberOfBytesToRead;
	}
	return (true); //Done!
}

//Given the data packet, send the header then the data
//Returns false if sensor does not ACK
//TODO - Arduino has a max 32 byte send. Break sending into multi packets if needed.
bool IMU_sendPacket(uint8_t channelNumber, uint8_t dataLength)
{
	uint8_t packetLength = dataLength + 4; //Add four bytes for the header

	/*  *********** POPULATE HEADER ****************************** */
	outPacket[0] = packetLength & 0xFF; 				//Packet length LSB
	outPacket[1] = packetLength >> 8; 					//Packet length MSB
	outPacket[2] = channelNumber; 						//Channel number
	outPacket[3] = sequenceNumber[channelNumber]++;	//Send the sequence number, increments with each packet sent, different counter for each channel

	/*  *********** FILL PAYLOAD ********************************* */
	memcpy(&(outPacket[4]), shtpData, dataLength);

	/*  *********** SEND TO IMU ********************************** */
	osSemaphoreAcquire(messageI2C_LockSem, osWaitForever);
	while( HAL_I2C_Master_Transmit(&hi2c1, _deviceAddress, outPacket, packetLength, 1000) != HAL_OK){
		osSemaphoreRelease(messageI2C_LockSem);
		HAL_Delay(100);
		osSemaphoreAcquire(messageI2C_LockSem, osWaitForever);
	}
	osSemaphoreRelease(messageI2C_LockSem);

	return (true);
}

////Pretty prints the contents of the current shtp header and data packets
//void IMU_printPacket(void)
//{
////	if (_printDebug == true)
////	{
////		uint16_t packetLength = (uint16_t)shtpHeader[1] << 8 | shtpHeader[0];
////
////		//Print the four byte header
////		_debugPort->print(F("Header:"));
////		for (uint8_t x = 0; x < 4; x++)
////		{
////			_debugPort->print(F(" "));
////			if (shtpHeader[x] < 0x10)
////				_debugPort->print(F("0"));
////			_debugPort->print(shtpHeader[x], HEX);
////		}
////
////		uint8_t printLength = packetLength - 4;
////		if (printLength > 40)
////			printLength = 40; //Artificial limit. We don't want the phone book.
////
////		_debugPort->print(F(" Body:"));
////		for (uint8_t x = 0; x < printLength; x++)
////		{
////			_debugPort->print(F(" "));
////			if (shtpData[x] < 0x10)
////				_debugPort->print(F("0"));
////			_debugPort->print(shtpData[x], HEX);
////		}
////
////		if (packetLength & 1 << 15)
////		{
////			_debugPort->println(F(" [Continued packet] "));
////			packetLength &= ~(1 << 15);
////		}
////
////		_debugPort->print(F(" Length:"));
////		_debugPort->print(packetLength);
////
////		_debugPort->print(F(" Channel:"));
////		if (shtpHeader[2] == 0)
////			_debugPort->print(F("Command"));
////		else if (shtpHeader[2] == 1)
////			_debugPort->print(F("Executable"));
////		else if (shtpHeader[2] == 2)
////			_debugPort->print(F("Control"));
////		else if (shtpHeader[2] == 3)
////			_debugPort->print(F("Sensor-report"));
////		else if (shtpHeader[2] == 4)
////			_debugPort->print(F("Wake-report"));
////		else if (shtpHeader[2] == 5)
////			_debugPort->print(F("Gyro-vector"));
////		else
////			_debugPort->print(shtpHeader[2]);
////
////		_debugPort->println();
////	}
//}



